Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.GetSortedDownstreamNodeIds
Get downstream nodes sorted by doing a token-by-token numeric or symbolic comparison.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.GetConnectedPhaseText(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases)
Get the text of the given electrical connected phases.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.GetAllAvailableConnectedPhasesOnDownstream(Autodesk.Revit.DB.ElementId)
Get all the available electrical connected phases that this power distributable node can provide to the downstream node.
Remarks:
If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B.
Usually one node may have many downstream nodes, but TransferSwitch can only have one downstream node.
id:
The downstream node id.
Returns:
All the available electrical connected phases that this power distributable node can provide to the downstream node.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id isn't a downstream node id of the power distributable node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.SetConnectedPhasesOnDownstream(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Electrical.ElectricalConnectedPhases)
Set the electrical connected phases of the downstream node.
Remarks:
If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B.
Usually one node may have many downstream nodes, but TransferSwitch can only have one downstream node.
id:
The downstream node id.
connectedPhases:
The electrical connected phases to set to the downstream node.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id isn't a downstream node id of the power distributable node.
-or-
The electrical connected phases can't be used to connect the downstream node to the power distributable node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.GetConnectedPhasesOnDownstream(Autodesk.Revit.DB.ElementId)
Get the electrical connected phases of the downstream node.
Remarks:
If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B.
Usually one node may have many downstream nodes, but TransferSwitch can only have one downstream node.
id:
The downstream node id.
Returns:
The electrical connected phases of the downstream node.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id isn't a downstream node id of the power distributable node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.GetDemandPerPhaseResults
Get an ElectricalPerPhaseData which contains each electrical phase's demand load and demand current of the power distributable node.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.GetApparentPerPhaseResults
Get an ElectricalPerPhaseData which contains each electrical phase's apparent load and apprent current of the power distributable node.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.AssignedPhasesNumber
The number of electrical phases assigned through the distribution system of the power distributable node.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.AssignedVoltage
The voltage assigned through the distribution system of the power distributable node.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData.DistributionSystem
The distribution system of the power distributable node.
Remarks:
In the case of a transformer, it's crucial that the number of phases in the secondary distribution system matches
that of the primary distribution system. If the number of phases in the primary system is set to be different from
that of the secondary distribution system, it will result in a 'PrimaryNumOfPhasesNotEqualWithSecondary' error.
If you anticipate this discrepancy, you can avoid the error by first setting the secondary distribution system to InvalidElementId,
and then setting the primary distribution system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id isn't a distribution system id.
-or-
When setting this property: The distribution system id can't be set to the power distributable node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
Represents the data and parameters of a power distributable node.
A power distribution node is an electrical analytical node with a distribution system which defines the connection rules between
upstream and downstream electrical analytical nodes.
Since:
2025